Revit 2027 API
FillGrid.GetHatchingDirection Method
 Provides the hatching propagation. Hatching is inverted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV GetHatchingDirection()
Public Function GetHatchingDirection As UV
public:
UV^ GetHatchingDirection()
member GetHatchingDirection : unit -> UV
Return Value
UV
 The direction of hatching.
See Also
Reference
FillGrid Class
Autodesk.Revit.DB Namespace